# Նախ print անենք քո անուն ազգանունը:
 
 
 
print("Grigor Manukyan")


#  Ստղծեք 2 փոփոխական, որոնցից առաջինի արժեքը ներկա թվականն է իսկ երկրորդինը ձեր տարիքը: 
#  print() անել առաջին փոփոխականից հանած երկրորդի պատասխանը:
x = 2023
y = 28
print(x - y)




# Ստղծեք փոփոխական full_name անունով, որին վերագրեք ձեր անուն ազգանունը:
#  Հետո Ստղծեք age փոփոխական որին կվերագրենք ձեր տարիքը:
#  print արեք երկու փոփոխականների արժեքները իրար կողք:


full_name = 'Grigor Manukyan'
age = 28
print(full_name,age)


# Ստղծեք փոփոխական, որտեղ գրեք ձեր բառերով մինչեվ հիմա քանի data type (տվյալների տեսակ) ենք անցել
#  ,ինչ ՈՉ ՊԱՐՏԱԴԻՐ ընդունված ձեվեր կա փոփոխական հայտարարելու ու վերջում ուղակի print արեք փոփոխականը:

variables = 'string,number,boolean,NoneType  x = 15 '
print(variables)

#  Կարող եք ձեր ամեն մի գրած կոդի վերեվում քոմենտ արեք օգտագործելով # նշանը
  #   Օրինակ ՝
  #         # stex cuyc enq talis mer anun azganun@
  #         print('anun azganun')
  #   ետ շատ լավ պռակտիկայա համարվում ու լավ կլինի սովորություն սարքեք որ հետո երբ վերադառնաք ձեռ հին կոդին իմանաք
  #   թե ինչի համար եք տենց գրել:
     
 #  Ունենք երկու փոփոխական x = 16, y = 5,լրացրեք արտահայտությունը այնպես որ      
  #   z-ը հավասար լինի True և տպեք z-ի type-ը:
     
   #  z = x(գրեք օպերատոր)y == 3
   
z = x // y == 3
print(type(z))     


 #  Ես ամեն ինչը կարաք մի հատել python-ի ինտերպրետատորում անեք, բայց ետ չենք կարա ստուգենք հանկարծ չխափեք :)))



 
# Փորձեք գտնել թե ինչ է անում % օպերատորը:
#answer    % operator@ cuyc e talis mnacord@

# Փորձեք հասկանալ ինչ է անում * օպերատորը ստրինգի վրա կիրառելիս:
#answer error e talis Syntax Error

# Կարող է արդյոք փոփոխականի անունը սկսվել թվով:
#answer voch